app/Http/Controllers/DashboardController.php

    public function index()
    {
        $inventories = Inventory::all();
---
SELECT * FROM `inventories`