app/Http/Controllers/InventoryController.php

SELECT * FROM `inventories`
---
    public function index()
    {
        // $inventories = Inventory::all();
        $inventories = Inventory::with('warehouse')->get();

SELECT * FROM `inventories` WHERE `inventories`.`id` = 6 LIMIT 1
---
    public function show(Inventory $inventory)
    {
        $inventory = Inventory::findOrFail($inventory->id);

SELECT * FROM `inventories`
---
    public function print()
    {
        $inventories = Inventory::with('warehouse')->get();