app/Http/Controllers/WarehouseController.php

SELECT * FROM `inventories` WHERE `inventories`.`warehouse_id` = 1 and `inventories`.`warehouse_id` IS not NULL
---
    public function show(Warehouse $warehouse)
    {
        $warehouse = Warehouse::findOrFail($warehouse->id);
        $inventories = $warehouse->inventories->load('warehouse');

SELECT * FROM `inventories` WHERE `inventories`.`warehouse_id` = 1 and `inventories`.`warehouse_id` IS not NULL
---
    public function print(Warehouse $warehouse)
    {
        $warehouse = Warehouse::findOrFail($warehouse->id);
        $inventories = $warehouse->inventories->load('warehouse');

SELECT * FROM `warehouses` WHERE `warehouses`.`id` = '1' LIMIT 1
SELECT * FROM `inventories` WHERE `inventories`.`warehouse_id` = 1 and `inventories`.`warehouse_id` IS not NULL
---
    public function printModal(Request $request)
    {
        $warehouse = Warehouse::findOrFail($request->warehouse_id ?? 1);
        $inventories = $warehouse->inventories->load('warehouse');